experiment-finetuned/all_finetuned/runs/Cylinder/2/constant/momentumTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

laminar
{
    laminarModel    generalizedNewtonian;

    generalizedNewtonianCoeffs
    {
        viscosityModel  CrossPowerLaw;

        nuInf   10;
        m       0.4;
        n       3;
    }
}

// ************************************************************************* //