experiment-finetuned/all_finetuned/runs/Cylinder/2/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // Block 0 - bottom left
    (-1 -1 -0.1)        // 0
    (-0.5 -1 -0.1)      // 1
    (-0.5 -0.5 -0.1)    // 2
    (-1 -0.5 -0.1)      // 3
    (-1 -1 0.1)         // 4
    (-0.5 -1 0.1)       // 5
    (-0.5 -0.5 0.1)     // 6
    (-1 -0.5 0.1)       // 7

    // Block 1 - bottom right
    (-0.5 -1 -0.1)      // 8
    (1 -1 -0.1)         // 9
    (1 -0.5 -0.1)       // 10
    (-0.5 -0.5 -0.1)    // 11
    (-0.5 -1 0.1)       // 12
    (1 -1 0.1)          // 13
    (1 -0.5 0.1)        // 14
    (-0.5 -0.5 0.1)     // 15

    // Block 2 - top left
    (-1 0.5 -0.1)       // 16
    (-0.5 0.5 -0.1)     // 17
    (-0.5 1 -0.1)       // 18
    (-1 1 -0.1)         // 19
    (-1 0.5 0.1)        // 20
    (-0.5 0.5 0.1)      // 21
    (-0.5 1 0.1)        // 22
    (-1 1 0.1)          // 23

    // Block 3 - top right
    (-0.5 0.5 -0.1)     // 24
    (1 0.5 -0.1)        // 25
    (1 1 -0.1)          // 26
    (-0.5 1 -0.1)       // 27
    (-0.5 0.5 0.1)      // 28
    (1 0.5 0.1)         // 29
    (1 1 0.1)           // 30
    (-0.5 1 0.1)        // 31

    // Block 4 - cylinder
    (-0.5 -0.5 -0.1)    // 32
    (-0.5 0.5 -0.1)     // 33
    (0.5 0.5 -0.1)      // 34
    (0.5 -0.5 -0.1)     // 35
    (-0.5 -0.5 0.1)     // 36
    (-0.5 0.5 0.1)      // 37
    (0.5 0.5 0.1)       // 38
    (0.5 -0.5 0.1)      // 39
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (40 10 1) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (10 10 1) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31) (40 10 1) simpleGrading (1 1 1)
    hex (35 34 33 32 39 38 37 36) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (16 20 23 19)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 13 14 10)
            (25 29 30 26)
        );
    }
    top
    {
        type wall;
        faces
        (
            (19 23 22 18)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (8 12 15 11)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (32 36 39 35)
            (33 37 38 34)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (8 9 10 11)
            (12 13 14 15)
            (16 17 18 19)
            (20 21 22 23)
            (24 25 26 27)
            (28 29 30 31)
            (32 33 34 35)
            (36 37 38 39)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //